{
    "fr": {
        "navbar-about": "Présentation",
        "navbar-formation": "Formation",
        "navbar-skills": "Compétences",
        "navbar-projects": "Projets",
        "navbar-contact": "Contact",
        "banner-description": "Passionné de programmation et de nouvelles technologies.",
        "banner-button": "Pour commencer",
        "about-title": "Présentation",
        "about-who": "Qui suis-je ?",
        "about-description": "Ingénieur du Numérique - Spécialisé en sécurité numérique et réseaux.",
        "about-passion": "Je suis passionné de programmation et de nouvelles technologies.",
        "about-cv-text": "Si vous êtes intéressé par mon profil, n'hésitez pas à",
        "about-cv-link": "télécharger mon CV",
        "about-cv-end": "et à me contacter !",
        "link-github": "Voir mon profil Github",
        "link-linkedin": "Voir mon profil Linkedin",
        "formation-title": "Formation & Diplômes",
        "formation-ISEP": "Ecole d'ingénieur du numérique - ISEP (2020 - 2023)",
        "formation-ISEP-description": "Parcours Sécurité Numérique et Réseaux, Cursus fait en Apprentissage.",
        "formation-Prepa": "Lycée Pierre-Gilles de Gennes - ENCPB (2018 - 2020)",
        "formation-Prepa-description": "Classe Préparatoire aux Grandes Ecoles - PCSI/PSI",
        "formation-lycee": "Lycée Maurice Rondeau",
        "formation-lycee-description": "Baccalauréat Scientifique option mathématique (2018)",
        "skills-title": "Compétences",
        "skill-software": "Développement Logiciel",
        "skills-Web": "Développement Web",
        "skills-database": "Bases de données",
        "skills-tools": "Outils",
        "skills-management": "Gestions de Projet",
        "skills-language": "Langues",
        "skills-french": "Français",
        "skills-french-description": "Maternelle",
        "skills-english": "Anglais",
        "skills-english-description": "TOEIC 915 points",
        "skills-jp": "Japonais",
        "skills-jp-description": "Connaissance élémentaire",
        "skills-vn-title": "Vietnamien",
        "skills-vn-description": "Je comprends et parle un peu vietnamien, mais seulement dans un contexte familial.",
        "projects-title": "Projets",
        "projects-description": "Ces différents projets montrent mon intérêt et ma curiosité pour les sujets liés à l'informatique.",
        "projects-description-2": "Les projets ci-dessous ont été réalisés dans le cadre de mes études ou de ma propre initiative.",
        "projects-description-3": "Je diffuserai très prochainement d'autre projets en cours. (n'hésitez pas à cliquer sur les différentes cases afin d'avoir plus de détails)",
        "projects-heartbeat": "Conception d'un appareil de mesures Psychotechniques",
        "projects-unity": "Conception d'un jeu sur Unity",
        "projects-Java": "Programmation d'un jeu de Plateau en JAVA",
        "projects-fall": "Programmation d'une simulation d'une chute d'un objet",
        "projects-TIPE": "Etudes TIPE sur le Flyboard",
        "cv-link": "Mon CV",
        "project-information": "Informations",
        "project-context": "Cadre",
        "project-personal": "Projet personnel",
        "project-school": "Projet Scolaire",
        "project-duration": "Durée",
        "project-participants": "Participants au projet",
        "project-responsibility": "Rôle",
        "project-none": "Aucun",
        "project-os": "OS / Outils",
        "project-languages": "Langages utilisés",
        "project-framework": "Frameworks utilisés",
        "project-IDS-responsibility": "Analyste Sécurité",
        "project-IDS-description": "Projet scolaire : recherche sur les systèmes de détection d'intrusion (IDS).",
        "project-IDS-description-2": "Pour une présentation exhaustive du sujet, j'ai opté pour le déploiement d'un IDS en utilisant SNORT et OSSEC. Ces derniers ont été installés sur une machine virtuelle Linux. Ensuite, à l'aide d'une autre machine virtuelle (Kali), j'ai procédé à des tests pour évaluer la capacité du système à détecter les intrusions.",
        "project-responsibility-dev": "Developpeur",
        "project-ARI-description": "Projet Scolaire où il fallait configurer le robot ARI",
        "project-ARI-description-2": "lui ajouter des fonctionnalités tel que bouger, réagir à son environnement etc...",
        "project-Nas-description": "Projet personnel pour découvrir ce qu'est un serveur NAS",
        "project-Nas-description-2": "Faute de moyens et de matériel, le projet n'a pas abouti.",
        "project-portfolio-description": "Je suis amené dans le cadre de mes études à trouver une alternance. J'ai eu l'idée de réaliser mon portfolio afin de pouvoir détailler plus en détails mes compétences et mes projets réalisés.",
        "project-portfolio-description-2": "La création de mon portfolio m'a permis de mettre en pratique mes cours de (HTML/CSS,JavaScript). Durant la conception de mon portfolio, j'ai travaillé en localhost en utilisant le logiciel MAMP et j'en ai fait un repository github public. Aujourd'hui, mon portfolio est hébergé par netlify, avec netlify j'ai pu construire mon portfolio seulement en mettant à jour mon repository github.",
        "project-APP-description": "La conception de cet objet est issue de l'Apprentissage Par Projet (APP), ce type d'enseignement est particulier à l'ISEP, il occupe une place importante dans l'enseignement des bases de l'informatique, de l'électronique, du traitement du signal et des télécommunications.",
        "project-APP-description-2": "Dans le cas de cette année, il faut faire un appareil de mesure psychotechnique ainsi qu'un site web où l'utilisateur pourra voir les données de ces mesures.",
        "project-unity-description": "La conception de ce jeu est une activité de découverte d'unity, de plus cela me permet d'avoir des bases dans l'utilisation de ce logiciel et de connaître quelques fonctions de C# ",
        "project-unity-description-2": "Ce petit projet personnel vient du fait que je suis membre du Virtual Lab de Garage ISEP, une association qui fait des projets et des activités selon le Lab en question.",
        "project-Java-description": "La conception de ce jeu de plateau est dans le cadre devoir/projet de classe pour l'enseignement en JAVA",
        "project-Java-description-2": "Le jeu de plateau en question à programmer est : MrJackPocket",
        "project-TIPE-description": "Le TIPE est une étude sur le thème de  l'océan. Cette étude avait pour but une présentation pour les concours CPGE mais cette présentation a été annulée à cause du COVID.",
        "project-fall-description": "Le codage de la simulation est un devoir/projets d'analyse de la chute d'un objet dans le vide, l'air et l'eau.",
        "end": "fin"
    },
    "en": {
        "navbar-about": "About",
        "navbar-formation": "Education",
        "navbar-skills": "Skills",
        "navbar-projects": "Projects",
        "navbar-contact": "Contact",
        "banner-description": "Enthusiast of cutting-edge technology and innovation.",
        "banner-button": "Get Started",
        "about-title": "About Me",
        "about-who": "Who am i ?",
        "about-description": "Digital Engineer - Specialized in digital security and networking",
        "about-passion": "I have a deep interest in exploring emerging technologies and discovering innovative digital solutions. I'm always eager to learn and stay ahead of trends in the tech world.",
        "about-cv-text": "If my profile resonates with you, please feel free to ",
        "about-cv-link": "download my resume",
        "about-cv-end": " and get in touch !",
        "link-github": "View my GitHub profile",
        "link-linkedin": "View my LinkedIn profile",
        "formation-title": "Education",
        "formation-ISEP": "ISEP - Graduate Engineering School (2020 - 2023)",
        "formation-ISEP-description": "Master in Engineering - Specialized in Security and Networking",
        "formation-Prepa": "Prep School Lycée Pierre-Gilles de Gennes - ENCPB (2018 - 2020)",
        "formation-Prepa-description": "undergraduate studies preparing for nationwide competitive entry exams to engineering schools. Subjects studied : Mathematics, Physics, French literature and English",
        "formation-lycee": "High School Lycée Maurice Rondeau",
        "formation-lycee-description": "French High School Diploma in Science, specialized in Mathematics (2018)",
        "skills-title": "Skills",
        "skill-software": "Software Development",
        "skills-Web": "Web Development",
        "skills-database": "Databases",
        "skills-tools": "Tools",
        "skills-management": "Project Management",
        "skills-language": "languages",
        "skills-french": "French",
        "skills-french-description": "Native proficiency",
        "skills-english": "English",
        "skills-english-description": "Professional proficiency",
        "skills-jp": "Japanese",
        "skills-jp-description": "elementary proficiency",
        "skills-vn-title": "Vietnamese",
        "skills-vn-description": "I understand and speak some Vietnamese, but only in a family setting.",
        "projects-title": "Projects",
        "projects-description": "These various projects showcase my interest and curiosity in computer-related fields.",
        "projects-description-2": "The projects below were undertaken as part of my studies or on my own initiative.",
        "projects-description-3": "I’ll soon be sharing more ongoing projects. (Feel free to click on the different sections for additional details!)",
        "projects-heartbeat": "Development of a device for psychotechnical evaluations",
        "projects-unity": "Game development using Unity",
        "projects-Java": "Development of a board game in Java",
        "projects-fall": "Creating a simulation of a falling object",
        "projects-TIPE": "TIPE research project on Flyboard",
        "cv-link": "My Resume",
        "project-information": "Details",
        "project-context": "Context",
        "project-personal": "Personal project",
        "project-school": "School project",
        "project-duration": "Duration",
        "project-participants": "Projects Participants",
        "project-responsibility": "Responsibility",
        "project-none": "None",
        "project-os": "OS / Tools",
        "project-languages": "Programming languages",
        "project-framework": "Frameworks",
        "project-IDS-responsibility": "Security Analyst",
        "project-IDS-description": "School project: Research on Intrusion Detection Systems (IDS).",
        "project-IDS-description-2": "For a comprehensive presentation of the topic, I chose to deploy an IDS using SNORT and OSSEC. These were installed on a Linux virtual machine. Then, using another virtual machine (Kali), I conducted tests to assess the system's ability to detect intrusions.",
        "project-responsibility-dev": "Developer",
        "project-ARI-description": "This school project involved configuring the ARI robot",
        "project-ARI-description-2": "and enhancing it with new features, such as mobility and the ability to respond to its environment.",
        "project-Nas-description": "Personal project to explore NAS (Network-Attached Storage) servers.",
        "project-Nas-description-2": "Due to limited resources and hardware, the project was not completed.",
        "project-portfolio-description": "As part of my studies, I needed to find an apprenticeship. I decided to create a portfolio to showcase my skills and projects in more detail.",
        "project-portfolio-description-2": "Building my portfolio allowed me to apply my knowledge of (HTML/CSS, JavaScript). I initially developed it locally using MAMP and made it a public GitHub repository. Now, my portfolio is hosted on Netlify, which automatically updates it whenever I push changes to GitHub.",
        "project-APP-description": "This project was developed as part of the Project-Based Learning (APP) approach, a key teaching method at ISEP. It plays a major role in learning the fundamentals of computer science, electronics, signal processing, and telecommunications.",
        "project-APP-description-2": "This year’s project involved designing a psychotechnical measurement device along with a website where users could view their recorded data.",
        "project-unity-description": "This game project was an opportunity to explore Unity. It also helped me build a foundation in using the software and understanding some C# functions.",
        "project-unity-description-2": "This small personal project was inspired by my involvement in the Virtual Lab at Garage ISEP, an association that develops projects and activities based on different labs.",
        "project-Java-description": "This board game project was part of a class assignment to learn Java programming.",
        "project-Java-description-2": "The board game to be developed was 'Mr. Jack Pocket'.",
        "project-TIPE-description": "The TIPE was a research project centered around ocean-related topics. Initially intended as a presentation for CPGE entrance exams, it was ultimately canceled due to the COVID pandemic.",
        "project-fall-description": "This coding project involved simulating the fall of an object in a vacuum, air, and water as part of an assignment.",
        "end": "end"
    }
}
